Repository: CofficLab/Cisum_SwiftUI
Catalog: Packages/PluginFileLog/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hant_hk

source: Collect OSLog entries to disk files with auto-rotation and cleanup
zh_hans: 收集系统日志到磁盘文件，支持自动轮转和清理
zh_hant_hk: 收集系統日誌到磁盤文件，支持自動輪轉和清理

source: File Log
zh_hans: 文件日志
zh_hant_hk: 文件日誌

source: Logs app runtime and file operations to help troubleshoot issues
zh_hans: 记录应用运行与文件操作日志，便于排查问题。
zh_hant_hk: 記錄應用程式執行與檔案操作日誌，便於排查問題。

source: Version
zh_hans: 版本
zh_hant_hk: 版本

source: Type
zh_hans: 类型
zh_hant_hk: 類型

source: Plugin
zh_hans: 插件
zh_hant_hk: 外掛程式

source: Core Capabilities
zh_hans: 核心能力
zh_hant_hk: 核心能力

source: Records key runtime events.
zh_hans: 记录关键运行事件。
zh_hant_hk: 記錄關鍵執行事件。

source: Logging
zh_hans: 日志记录
zh_hant_hk: 日誌記錄

source: Searches logs by keyword.
zh_hans: 按关键字检索日志。
zh_hant_hk: 依關鍵字檢索日誌。

source: Search Logs
zh_hans: 检索
zh_hant_hk: 檢索

source: Clears historical logs.
zh_hans: 清理历史日志。
zh_hant_hk: 清除歷史日誌。

source: Clean Up
zh_hans: 清理
zh_hant_hk: 清理

source: Overview
zh_hans: 概述
zh_hant_hk: 概述

source: Logging: records key runtime events.
zh_hans: 日志记录：记录关键运行事件。
zh_hant_hk: 日誌記錄：記錄關鍵執行事件。

source: Search Logs: searches logs by keyword.
zh_hans: 检索：按关键字检索日志。
zh_hant_hk: 檢索：依關鍵字檢索日誌。

source: Clean Up: clears historical logs.
zh_hans: 清理：清理历史日志。
zh_hant_hk: 清理：清除歷史日誌。

source: Basic Operations
zh_hans: 基本操作
zh_hant_hk: 基本操作

source: Opens the log view to inspect records.
zh_hans: 打开日志视图查看记录。
zh_hant_hk: 開啟日誌檢視查看記錄。

source: Searches by keyword to locate issues.
zh_hans: 按关键字检索定位问题。
zh_hant_hk: 依關鍵字檢索定位問題。

source: Periodically clears expired logs.
zh_hans: 定期清理过期日志。
zh_hant_hk: 定期清除過期日誌。

source: Notes
zh_hans: 说明
zh_hant_hk: 說明

source: Available on macOS only.
zh_hans: 仅在 macOS 上可用。
zh_hant_hk: 僅在 macOS 上可用。
